using Newtonsoft.Json;
using ResumeAggregator.Models.E1;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Web.Mvc;

namespace ResumeAggregator.Controllers
{
    public class HomeController : Controller
    {
        public ActionResult Index()
        {
            ViewBag.Title = "Home Page";
            
            return View();
        }

        //GET:https://ekb.zarplata.ru/api/v1/resumes/?state%5B%5D=1&visibility_type=1&average_salary=true&categories_facets=1&city_id=994&entity=1&geo_id%5B%5D=994&rubric_id%5B%5D=50&search_type=fullThrottle&limit=25&offset=0&fields=add_date%2Cmod_date%2Cage_pretty%2Cattachment%2Cbirthday%2Ccontact%2Ceducation%2Ceducation_specialty%2Cexperience%2Cexperience_length%2Cexperience_prune%2Cheader%2Cid%2Cinfo%2Cis_upped%2Cis_journey%2Cjobs%2Cowner_id%2Cphoto%2Csalary%2Cstate%2Curl%2Cvalidate_state%2Cviews%2Chide_birthday%2Csex
        //public string GetE1JSON
        public static E1CV DeserializeCV(string json)
        {
        json = @"
        { 'metadata': {
            'query': {
              'state': [
                '1'
              ],
              'visibility_type': '1',
              'average_salary': true,
              'categories_facets': '1',
              'city_id': '994',
              'search_type': 'fullThrottle',
              'geo_id': '994'
            },
            'categories_facets': [
              {
                'id': 241,
                'title': 'Транспорт, автобизнес',
                'count': 17464,
                'specialities': [
                  {
                    'id': 249,
                    'title': 'Грузовые перевозки',
                    'count': 8237
                  },
                  {
                    'id': 7002,
                    'title': 'Автоперевозки',
                    'count': 4765
                  },
                  {
                    'id': 242,
                    'title': 'Пассажирские перевозки',
                    'count': 4600
                  },
                  {
                    'id': 245,
                    'title': 'Автосервис',
                    'count': 2244
                  },
                  {
                    'id': 569,
                    'title': 'Продажа автозапчастей',
                    'count': 1671
                  },
                  {
                    'id': 247,
                    'title': 'Прочее',
                    'count': 1622
                  },
                  {
                    'id': 7042,
                    'title': 'Спецтехника',
                    'count': 1130
                  },
                  {
                    'id': 244,
                    'title': 'Продажи авто',
                    'count': 1051
                  },
                  {
                    'id': 250,
                    'title': 'Начало карьеры',
                    'count': 859
                  },
                  {
                    'id': 7022,
                    'title': 'Железнодорожные перевозки',
                    'count': 524
                  },
                  {
                    'id': 246,
                    'title': 'Мойки, шиномонтаж',
                    'count': 416
                  },
                  {
                    'id': 251,
                    'title': 'Без спец. подготовки',
                    'count': 283
                  },
                  {
                    'id': 6982,
                    'title': 'Продажа траспортных услуг',
                    'count': 261
                  },
                  {
                    'id': 7012,
                    'title': 'Диспетчерские службы',
                    'count': 205
                  },
                  {
                    'id': 6992,
                    'title': 'Авиаперевозки',
                    'count': 38
                  },
                  {
                    'id': 7032,
                    'title': 'Морские, речные перевозки',
                    'count': 12
                  }
                ]
              },
              {
                'id': 149,
                'title': 'Персонал офиса, АХО',
                'count': 13211,
                'specialities': [
                  {
                    'id': 151,
                    'title': 'Секретариат, офис-менеджер, ресепшн',
                    'count': 5805
                  },
                  {
                    'id': 153,
                    'title': 'Ввод данных, операторы',
                    'count': 3546
                  },
                  {
                    'id': 150,
                    'title': 'Делопроизводство',
                    'count': 2977
                  },
                  {
                    'id': 152,
                    'title': 'Прием звонков, call-центр',
                    'count': 2397
                  },
                  {
                    'id': 1437,
                    'title': 'Водители',
                    'count': 1714
                  },
                  {
                    'id': 529,
                    'title': 'АХО, хозяйственники',
                    'count': 1267
                  },
                  {
                    'id': 1457,
                    'title': 'Курьеры',
                    'count': 1010
                  },
                  {
                    'id': 157,
                    'title': 'Начало карьеры',
                    'count': 837
                  },
                  {
                    'id': 154,
                    'title': 'Прочее',
                    'count': 683
                  },
                  {
                    'id': 156,
                    'title': 'Без спец. подготовки',
                    'count': 504
                  },
                  {
                    'id': 531,
                    'title': 'Уборка',
                    'count': 385
                  },
                  {
                    'id': 1477,
                    'title': 'Переводы',
                    'count': 356
                  }
                ]
              },
              {
                'id': 432,
                'title': 'Торговля розничная',
                'count': 12605,
                'specialities': [
                  {
                    'id': 592,
                    'title': 'Одежда, обувь',
                    'count': 5875
                  },
                  {
                    'id': 590,
                    'title': 'Товары народного потребления',
                    'count': 4912
                  },
                  {
                    'id': 585,
                    'title': 'Продукты питания',
                    'count': 3539
                  },
                  {
                    'id': 594,
                    'title': 'Алкоголь, табачные изделия',
                    'count': 3086
                  },
                  {
                    'id': 593,
                    'title': 'Мебель, предметы интерьера',
                    'count': 3082
                  },
                  {
                    'id': 595,
                    'title': 'Касса',
                    'count': 3056
                  },
                  {
                    'id': 588,
                    'title': 'Бытовая техника',
                    'count': 2930
                  },
                  {
                    'id': 591,
                    'title': 'Строительные материалы',
                    'count': 2777
                  },
                  {
                    'id': 445,
                    'title': 'Прочее',
                    'count': 2724
                  },
                  {
                    'id': 596,
                    'title': 'Мерчендайзинг',
                    'count': 2365
                  },
                  {
                    'id': 589,
                    'title': 'Компьютерная техника',
                    'count': 1462
                  },
                  {
                    'id': 434,
                    'title': 'Начало карьеры',
                    'count': 1225
                  },
                  {
                    'id': 433,
                    'title': 'Без спец. подготовки',
                    'count': 826
                  }
                ]
              },
              {
                'id': 1,
                'title': 'Бухгалтерия, финансы, банки',
                'count': 11751,
                'specialities': [
                  {
                    'id': 6,
                    'title': 'Бухгалтерия',
                    'count': 5721
                  },
                  {
                    'id': 877,
                    'title': 'Первичная бухгалтерия',
                    'count': 3489
                  },
                  {
                    'id': 19,
                    'title': 'Экономисты',
                    'count': 2893
                  },
                  {
                    'id': 18,
                    'title': 'Отчетность, налогообложение',
                    'count': 2295
                  },
                  {
                    'id': 2,
                    'title': 'Финансовый анализ, бюджетирование',
                    'count': 2046
                  },
                  {
                    'id': 478,
                    'title': 'Кассовые операции, инкассация',
                    'count': 1874
                  },
                  {
                    'id': 777,
                    'title': 'Учёт счетов и платежей',
                    'count': 1732
                  },
                  {
                    'id': 837,
                    'title': 'Учёт заработной платы',
                    'count': 1671
                  },
                  {
                    'id': 12,
                    'title': 'Консультирование',
                    'count': 1537
                  },
                  {
                    'id': 737,
                    'title': 'Продажи финансовых услуг',
                    'count': 1384
                  },
                  {
                    'id': 817,
                    'title': 'Учёт ТМЦ (МПЗ)',
                    'count': 1376
                  },
                  {
                    'id': 857,
                    'title': 'Управленческий учёт',
                    'count': 1200
                  },
                  {
                    'id': 13,
                    'title': 'Кредитование розничное',
                    'count': 1199
                  },
                  {
                    'id': 16,
                    'title': 'Начало карьеры',
                    'count': 1166
                  },
                  {
                    'id': 797,
                    'title': 'Учёт основных средств',
                    'count': 1159
                  },
                  {
                    'id': 17,
                    'title': 'Операционисты ',
                    'count': 1139
                  },
                  {
                    'id': 477,
                    'title': 'Аудит, внутрений контроль',
                    'count': 944
                  },
                  {
                    'id': 475,
                    'title': 'Кредитование малого бизнеса',
                    'count': 836
                  },
                  {
                    'id': 476,
                    'title': 'Кредитование корпоративное',
                    'count': 768
                  },
                  {
                    'id': 697,
                    'title': 'Анализ рисков, оценка',
                    'count': 709
                  },
                  {
                    'id': 9,
                    'title': 'Внутренние операции (back office)',
                    'count': 704
                  },
                  {
                    'id': 717,
                    'title': 'Управленческий персонал',
                    'count': 670
                  },
                  {
                    'id': 440,
                    'title': 'Прочее',
                    'count': 644
                  },
                  {
                    'id': 3,
                    'title': 'Банковские технологии, методология',
                    'count': 536
                  },
                  {
                    'id': 677,
                    'title': 'Взыскание задолженности',
                    'count': 454
                  },
                  {
                    'id': 14,
                    'title': 'Лизинг',
                    'count': 293
                  },
                  {
                    'id': 757,
                    'title': 'Маркетинг',
                    'count': 214
                  },
                  {
                    'id': 897,
                    'title': 'Без спец. подготовки',
                    'count': 194
                  }
                ]
              },
              {
                'id': 119,
                'title': 'Строительство, недвижимость',
                'count': 11057,
                'specialities': [
                  {
                    'id': 125,
                    'title': 'Строительство',
                    'count': 5693
                  },
                  {
                    'id': 126,
                    'title': 'Монтажные работы',
                    'count': 3404
                  },
                  {
                    'id': 122,
                    'title': 'Инженерные специальности',
                    'count': 3173
                  },
                  {
                    'id': 121,
                    'title': 'Эксплуатации зданий, сфера жкх',
                    'count': 2474
                  },
                  {
                    'id': 510,
                    'title': 'Отделочные работы',
                    'count': 2155
                  },
                  {
                    'id': 123,
                    'title': 'Проектирование, архитектура',
                    'count': 1919
                  },
                  {
                    'id': 3628,
                    'title': 'Управление строительством',
                    'count': 1900
                  },
                  {
                    'id': 3588,
                    'title': 'Электроснабжение',
                    'count': 1134
                  },
                  {
                    'id': 3568,
                    'title': 'Отопление, вентиляция',
                    'count': 1133
                  },
                  {
                    'id': 3488,
                    'title': 'Водоснабжение, канализация',
                    'count': 1107
                  },
                  {
                    'id': 120,
                    'title': 'Прочее',
                    'count': 1022
                  },
                  {
                    'id': 3508,
                    'title': 'Дорожное строительство',
                    'count': 945
                  },
                  {
                    'id': 127,
                    'title': 'Геодезия, картография',
                    'count': 686
                  },
                  {
                    'id': 3548,
                    'title': 'Сметное дело',
                    'count': 668
                  },
                  {
                    'id': 128,
                    'title': 'Начало карьеры',
                    'count': 653
                  },
                  {
                    'id': 3468,
                    'title': 'Агентства недвижимости, риелторы',
                    'count': 509
                  },
                  {
                    'id': 3528,
                    'title': 'Управление коммерческой недвижимостью',
                    'count': 376
                  },
                  {
                    'id': 129,
                    'title': 'Без спец. подготовки',
                    'count': 193
                  }
                ]
              },
              {
                'id': 171,
                'title': 'Промышленность',
                'count': 9532,
                'specialities': [
                  {
                    'id': 174,
                    'title': 'Инженерные специальности',
                    'count': 4591
                  },
                  {
                    'id': 556,
                    'title': 'Машиностроение',
                    'count': 4119
                  },
                  {
                    'id': 179,
                    'title': 'Металлургия',
                    'count': 2311
                  },
                  {
                    'id': 187,
                    'title': 'Тяжелая промышленность',
                    'count': 2210
                  },
                  {
                    'id': 177,
                    'title': 'Легкая промышленность',
                    'count': 2201
                  },
                  {
                    'id': 181,
                    'title': 'Оборудование, приборостроение',
                    'count': 2125
                  },
                  {
                    'id': 180,
                    'title': 'Нефтепереработка',
                    'count': 1933
                  },
                  {
                    'id': 190,
                    'title': 'Химическая промышленность',
                    'count': 1821
                  },
                  {
                    'id': 184,
                    'title': 'Рабочие специальности',
                    'count': 1765
                  },
                  {
                    'id': 186,
                    'title': 'Стройматериалы, деревообрабатывающая промышленность',
                    'count': 1658
                  },
                  {
                    'id': 178,
                    'title': 'Мебель',
                    'count': 1604
                  },
                  {
                    'id': 176,
                    'title': 'Контроль качества',
                    'count': 1437
                  },
                  {
                    'id': 173,
                    'title': 'Прочее',
                    'count': 1398
                  },
                  {
                    'id': 182,
                    'title': 'Охрана труда',
                    'count': 1200
                  },
                  {
                    'id': 6952,
                    'title': 'Пищевая промышленность',
                    'count': 636
                  },
                  {
                    'id': 192,
                    'title': 'Начало карьеры',
                    'count': 627
                  },
                  {
                    'id': 185,
                    'title': 'Сельхозпроизводство',
                    'count': 421
                  },
                  {
                    'id': 546,
                    'title': 'Пивоваренная и безалкогольных напитков',
                    'count': 244
                  },
                  {
                    'id': 545,
                    'title': 'Мясо- и птицепереработка',
                    'count': 207
                  },
                  {
                    'id': 193,
                    'title': 'Без спец. подготовки',
                    'count': 178
                  }
                ]
              },
              {
                'id': 69,
                'title': 'Логистика, склад, закупки',
                'count': 9272,
                'specialities': [
                  {
                    'id': 71,
                    'title': 'Складское хозяйство',
                    'count': 5068
                  },
                  {
                    'id': 70,
                    'title': 'Логистика',
                    'count': 3151
                  },
                  {
                    'id': 72,
                    'title': 'Закупки и снабжение',
                    'count': 3031
                  },
                  {
                    'id': 74,
                    'title': 'Прочее',
                    'count': 845
                  },
                  {
                    'id': 76,
                    'title': 'Начало карьеры',
                    'count': 665
                  },
                  {
                    'id': 75,
                    'title': 'Таможня, ВЭД',
                    'count': 577
                  },
                  {
                    'id': 77,
                    'title': 'Без спец. подготовки',
                    'count': 453
                  }
                ]
              },
              {
                'id': 571,
                'title': 'Продажи, торговля оптовая, сбыт',
                'count': 9174,
                'specialities': [
                  {
                    'id': 532,
                    'title': 'Работа с клиентами',
                    'count': 4068
                  },
                  {
                    'id': 576,
                    'title': 'Строительные материалы',
                    'count': 2425
                  },
                  {
                    'id': 159,
                    'title': 'Активные продажи',
                    'count': 2388
                  },
                  {
                    'id': 572,
                    'title': 'Управление продажами',
                    'count': 2353
                  },
                  {
                    'id': 573,
                    'title': 'Продукты питания',
                    'count': 2295
                  },
                  {
                    'id': 579,
                    'title': 'Алкоголь, табачные изделия',
                    'count': 2275
                  },
                  {
                    'id': 584,
                    'title': 'Товары народного потребления',
                    'count': 2080
                  },
                  {
                    'id': 3248,
                    'title': 'Продажа услуг',
                    'count': 1891
                  },
                  {
                    'id': 581,
                    'title': 'Прочее',
                    'count': 1840
                  },
                  {
                    'id': 580,
                    'title': 'Станки, оборудование',
                    'count': 1674
                  },
                  {
                    'id': 574,
                    'title': 'Бытовая техника, электроника',
                    'count': 1438
                  },
                  {
                    'id': 578,
                    'title': 'Мебель, предметы интерьера',
                    'count': 1359
                  },
                  {
                    'id': 3188,
                    'title': 'Сырье',
                    'count': 1251
                  },
                  {
                    'id': 3148,
                    'title': 'Металлопрокат',
                    'count': 1193
                  },
                  {
                    'id': 577,
                    'title': 'Одежда, обувь',
                    'count': 1038
                  },
                  {
                    'id': 575,
                    'title': 'Компьютерная техника, ПО',
                    'count': 1028
                  },
                  {
                    'id': 3208,
                    'title': 'Косметика, бытовая химия',
                    'count': 909
                  },
                  {
                    'id': 582,
                    'title': 'Начало карьеры',
                    'count': 688
                  },
                  {
                    'id': 3268,
                    'title': 'Сантехника',
                    'count': 674
                  },
                  {
                    'id': 3168,
                    'title': 'Продажа рекламы',
                    'count': 592
                  },
                  {
                    'id': 583,
                    'title': 'Без спец. подготовки',
                    'count': 359
                  },
                  {
                    'id': 3228,
                    'title': 'Зоотовары, ветеринарные препараты',
                    'count': 344
                  },
                  {
                    'id': 163,
                    'title': 'Телемаркетинг',
                    'count': 230
                  }
                ]
              },
              {
                'id': 268,
                'title': 'Рабочий персонал',
                'count': 7757,
                'specialities': [
                  {
                    'id': 269,
                    'title': 'Грузчик',
                    'count': 1386
                  },
                  {
                    'id': 277,
                    'title': 'Сварщик',
                    'count': 1160
                  },
                  {
                    'id': 272,
                    'title': 'Разнорабочий',
                    'count': 1003
                  },
                  {
                    'id': 278,
                    'title': 'Электрик',
                    'count': 762
                  },
                  {
                    'id': 279,
                    'title': 'Машинист',
                    'count': 743
                  },
                  {
                    'id': 1657,
                    'title': 'Монтажник',
                    'count': 743
                  },
                  {
                    'id': 1637,
                    'title': 'Укладчик-упаковщик, фасовщик',
                    'count': 726
                  },
                  {
                    'id': 1577,
                    'title': 'Сборщик',
                    'count': 721
                  },
                  {
                    'id': 276,
                    'title': 'Слесарь',
                    'count': 713
                  },
                  {
                    'id': 281,
                    'title': 'Прочее',
                    'count': 459
                  },
                  {
                    'id': 1737,
                    'title': 'Без спец. подготовки',
                    'count': 445
                  },
                  {
                    'id': 1597,
                    'title': 'Рабочие строительных специальностей',
                    'count': 395
                  },
                  {
                    'id': 1697,
                    'title': 'Оператор станков',
                    'count': 331
                  },
                  {
                    'id': 570,
                    'title': 'Сантехник',
                    'count': 318
                  },
                  {
                    'id': 1717,
                    'title': 'Начало карьеры ',
                    'count': 253
                  },
                  {
                    'id': 275,
                    'title': 'Токарь',
                    'count': 231
                  },
                  {
                    'id': 273,
                    'title': 'Маляр',
                    'count': 201
                  },
                  {
                    'id': 1557,
                    'title': 'Стропальщик',
                    'count': 184
                  },
                  {
                    'id': 270,
                    'title': 'Плотник',
                    'count': 173
                  },
                  {
                    'id': 271,
                    'title': 'Столяр',
                    'count': 135
                  },
                  {
                    'id': 280,
                    'title': 'Дворники, хозяйственники',
                    'count': 111
                  },
                  {
                    'id': 274,
                    'title': 'Фрезеровщик',
                    'count': 83
                  },
                  {
                    'id': 1677,
                    'title': 'Кузнец',
                    'count': 19
                  },
                  {
                    'id': 1617,
                    'title': 'Лифтер',
                    'count': 12
                  }
                ]
              },
              {
                'id': 225,
                'title': 'Рестораны, кафе, общепит',
                'count': 5983,
                'specialities': [
                  {
                    'id': 227,
                    'title': 'Официанты, бармены',
                    'count': 2544
                  },
                  {
                    'id': 232,
                    'title': 'Административный персонал',
                    'count': 1478
                  },
                  {
                    'id': 226,
                    'title': 'Повара',
                    'count': 1368
                  },
                  {
                    'id': 1817,
                    'title': 'Управление ресторанами, барами',
                    'count': 609
                  },
                  {
                    'id': 231,
                    'title': 'Начало карьеры',
                    'count': 544
                  },
                  {
                    'id': 1757,
                    'title': 'Кассовое обслуживание',
                    'count': 406
                  },
                  {
                    'id': 1837,
                    'title': 'Заведующий производством',
                    'count': 377
                  },
                  {
                    'id': 233,
                    'title': 'Без спец. подготовки',
                    'count': 365
                  },
                  {
                    'id': 1857,
                    'title': 'Обслуживающий персонал',
                    'count': 355
                  },
                  {
                    'id': 230,
                    'title': 'Прочее',
                    'count': 309
                  },
                  {
                    'id': 1797,
                    'title': 'Кейтеринг',
                    'count': 297
                  },
                  {
                    'id': 568,
                    'title': 'Персонал на кухню',
                    'count': 225
                  },
                  {
                    'id': 1777,
                    'title': 'Служба доставки',
                    'count': 152
                  }
                ]
              },
              {
                'id': 101,
                'title': 'Работа для молодёжи',
                'count': 4669,
                'specialities': [
                  {
                    'id': 495,
                    'title': 'Торговля розничная',
                    'count': 909
                  },
                  {
                    'id': 110,
                    'title': 'Персонал офиса',
                    'count': 760
                  },
                  {
                    'id': 114,
                    'title': 'Рестораны, кафе, общепит',
                    'count': 724
                  },
                  {
                    'id': 113,
                    'title': 'Спорт, красота, здоровье',
                    'count': 528
                  },
                  {
                    'id': 111,
                    'title': 'Продажи',
                    'count': 332
                  },
                  {
                    'id': 492,
                    'title': 'Туризм, гостиничное дело',
                    'count': 278
                  },
                  {
                    'id': 105,
                    'title': 'Маркетинг, реклама, PR',
                    'count': 247
                  },
                  {
                    'id': 497,
                    'title': 'Сфера услуг',
                    'count': 214
                  },
                  {
                    'id': 102,
                    'title': 'Бухгалтерия, финансы, банки',
                    'count': 186
                  },
                  {
                    'id': 6512,
                    'title': 'Дизайн, искусство, развлечения',
                    'count': 151
                  },
                  {
                    'id': 104,
                    'title': 'Логистика, склад, закупки',
                    'count': 147
                  },
                  {
                    'id': 6562,
                    'title': 'Транспорт, автобизнес',
                    'count': 143
                  },
                  {
                    'id': 103,
                    'title': 'ИТ и Интернет',
                    'count': 120
                  },
                  {
                    'id': 6552,
                    'title': 'Рабочий персонал',
                    'count': 108
                  },
                  {
                    'id': 112,
                    'title': 'Производство и промышленность',
                    'count': 104
                  },
                  {
                    'id': 109,
                    'title': 'Охрана, безопасность',
                    'count': 92
                  },
                  {
                    'id': 116,
                    'title': 'Прочее',
                    'count': 80
                  },
                  {
                    'id': 108,
                    'title': 'Строительство, архитектура',
                    'count': 78
                  },
                  {
                    'id': 496,
                    'title': 'Издательства и полиграфия, СМИ',
                    'count': 78
                  },
                  {
                    'id': 494,
                    'title': 'Торговля оптовая',
                    'count': 71
                  },
                  {
                    'id': 115,
                    'title': 'Телекоммуникации и связь',
                    'count': 67
                  },
                  {
                    'id': 106,
                    'title': 'Медицина и фармация',
                    'count': 49
                  },
                  {
                    'id': 6592,
                    'title': 'Образование, наука, языки',
                    'count': 49
                  },
                  {
                    'id': 6622,
                    'title': 'Страхование',
                    'count': 47
                  },
                  {
                    'id': 6582,
                    'title': 'Кадровые службы, HR',
                    'count': 46
                  },
                  {
                    'id': 6502,
                    'title': 'Государственные службы, НКО',
                    'count': 27
                  },
                  {
                    'id': 493,
                    'title': 'ТЭК, энергетика, добыча сырья',
                    'count': 25
                  },
                  {
                    'id': 6632,
                    'title': 'Юриспруденция',
                    'count': 22
                  },
                  {
                    'id': 6522,
                    'title': 'Персонал для дома',
                    'count': 14
                  },
                  {
                    'id': 6572,
                    'title': 'Инсталляция и сервис',
                    'count': 6
                  },
                  {
                    'id': 6612,
                    'title': 'Сельское хозяйство',
                    'count': 6
                  }
                ]
              },
              {
                'id': 50,
                'title': 'ИТ и Интернет',
                'count': 4633,
                'specialities': [
                  {
                    'id': 58,
                    'title': 'Системное администрирование',
                    'count': 1563
                  },
                  {
                    'id': 61,
                    'title': 'Техническая поддержка',
                    'count': 1257
                  },
                  {
                    'id': 57,
                    'title': 'Программирование, разработка',
                    'count': 896
                  },
                  {
                    'id': 51,
                    'title': 'Базы данных, администрирование',
                    'count': 833
                  },
                  {
                    'id': 54,
                    'title': 'Внедрение и сопровождение ПО',
                    'count': 792
                  },
                  {
                    'id': 67,
                    'title': 'Контент, наполнение сайтов',
                    'count': 742
                  },
                  {
                    'id': 55,
                    'title': 'Информационная безопасность',
                    'count': 654
                  },
                  {
                    'id': 63,
                    'title': 'Веб-дизайн, интерфейсы, верстка',
                    'count': 576
                  },
                  {
                    'id': 60,
                    'title': 'Управление проектами',
                    'count': 565
                  },
                  {
                    'id': 66,
                    'title': 'Начало карьеры',
                    'count': 552
                  },
                  {
                    'id': 52,
                    'title': 'Аналитика, проектирование, документация',
                    'count': 512
                  },
                  {
                    'id': 59,
                    'title': 'Тестирование',
                    'count': 456
                  },
                  {
                    'id': 442,
                    'title': 'Прочее',
                    'count': 389
                  },
                  {
                    'id': 64,
                    'title': 'Разработка веб-приложений',
                    'count': 374
                  },
                  {
                    'id': 56,
                    'title': 'Оптимизация, SEO',
                    'count': 329
                  },
                  {
                    'id': 53,
                    'title': 'Банковское, финансовое, биллинговое ПО',
                    'count': 256
                  },
                  {
                    'id': 479,
                    'title': 'Разработка для 1С',
                    'count': 256
                  },
                  {
                    'id': 3448,
                    'title': 'Продажи',
                    'count': 190
                  },
                  {
                    'id': 65,
                    'title': 'Консалтинг',
                    'count': 164
                  },
                  {
                    'id': 62,
                    'title': 'Мультимедиа',
                    'count': 162
                  },
                  {
                    'id': 480,
                    'title': 'Разработка desktop приложений',
                    'count': 158
                  },
                  {
                    'id': 481,
                    'title': 'Разработка мобильных приложений',
                    'count': 128
                  },
                  {
                    'id': 6972,
                    'title': 'Маркетинг',
                    'count': 118
                  },
                  {
                    'id': 6962,
                    'title': 'Разработка игрового ПО',
                    'count': 81
                  }
                ]
              },
              {
                'id': 20,
                'title': 'Высший менеджмент, руководители',
                'count': 4351,
                'specialities': [
                  {
                    'id': 3648,
                    'title': 'Руководители среднего звена',
                    'count': 2307
                  },
                  {
                    'id': 26,
                    'title': 'Продажи, торговля ',
                    'count': 1706
                  },
                  {
                    'id': 24,
                    'title': 'Директора, топ-менеджмент',
                    'count': 1362
                  },
                  {
                    'id': 30,
                    'title': 'Производство, промышленность',
                    'count': 980
                  },
                  {
                    'id': 3748,
                    'title': 'Управление малым бизнесом',
                    'count': 772
                  },
                  {
                    'id': 3788,
                    'title': 'Логистика, склад, закупки',
                    'count': 584
                  },
                  {
                    'id': 3848,
                    'title': 'Строительство, недвижимость',
                    'count': 573
                  },
                  {
                    'id': 3768,
                    'title': 'Автобизнес',
                    'count': 348
                  },
                  {
                    'id': 3728,
                    'title': 'Сфера услуг',
                    'count': 345
                  },
                  {
                    'id': 29,
                    'title': 'Управление персоналом, тренинги ',
                    'count': 324
                  },
                  {
                    'id': 35,
                    'title': 'Финансы, банки',
                    'count': 311
                  },
                  {
                    'id': 27,
                    'title': 'Маркетинг, реклама, pr ',
                    'count': 266
                  },
                  {
                    'id': 441,
                    'title': 'Прочее',
                    'count': 256
                  },
                  {
                    'id': 21,
                    'title': 'ИТ, Интернет, телекоммуникации ',
                    'count': 214
                  },
                  {
                    'id': 3688,
                    'title': 'Рестораны, кафе общепит',
                    'count': 157
                  },
                  {
                    'id': 3708,
                    'title': 'Туризм, гостиничное дело',
                    'count': 152
                  },
                  {
                    'id': 3668,
                    'title': 'Спорт, красота, здоровье',
                    'count': 130
                  },
                  {
                    'id': 23,
                    'title': ' Дизайн, искусство, развлечения ',
                    'count': 94
                  },
                  {
                    'id': 3808,
                    'title': 'Образование, наука, языки',
                    'count': 59
                  },
                  {
                    'id': 3828,
                    'title': 'Медицина и фармация',
                    'count': 43
                  }
                ]
              },
              {
                'id': 214,
                'title': 'Спорт, красота, здоровье',
                'count': 4093,
                'specialities': [
                  {
                    'id': 217,
                    'title': 'Административный персонал',
                    'count': 2434
                  },
                  {
                    'id': 221,
                    'title': 'Инструктаж, проведение тренировок',
                    'count': 577
                  },
                  {
                    'id': 223,
                    'title': 'Начало карьеры',
                    'count': 533
                  },
                  {
                    'id': 1877,
                    'title': 'Сауны, SPA-салоны, солярии',
                    'count': 474
                  },
                  {
                    'id': 218,
                    'title': 'Маникюр, косметология',
                    'count': 385
                  },
                  {
                    'id': 1917,
                    'title': 'Продажи',
                    'count': 334
                  },
                  {
                    'id': 220,
                    'title': 'Массаж, оздоровительные процедуры',
                    'count': 297
                  },
                  {
                    'id': 222,
                    'title': 'Прочее',
                    'count': 271
                  },
                  {
                    'id': 224,
                    'title': 'Без спец. подготовки',
                    'count': 239
                  },
                  {
                    'id': 219,
                    'title': 'Парикмахерское дело',
                    'count': 232
                  },
                  {
                    'id': 1897,
                    'title': 'Стилисты, визажисты',
                    'count': 160
                  }
                ]
              },
              {
                'id': 130,
                'title': 'Образование, наука, языки',
                'count': 3413,
                'specialities': [
                  {
                    'id': 136,
                    'title': 'Дошкольное образование',
                    'count': 1214
                  },
                  {
                    'id': 134,
                    'title': 'Репетиторство, помощь в учебе',
                    'count': 1045
                  },
                  {
                    'id': 135,
                    'title': 'Курсы, дополнительное образование',
                    'count': 1033
                  },
                  {
                    'id': 512,
                    'title': 'Средние учебные заведения',
                    'count': 1006
                  },
                  {
                    'id': 513,
                    'title': 'Среднеспециальные учебные заведения',
                    'count': 771
                  },
                  {
                    'id': 133,
                    'title': 'Иностранные языки',
                    'count': 591
                  },
                  {
                    'id': 511,
                    'title': 'Высшие учебные заведения',
                    'count': 548
                  },
                  {
                    'id': 1297,
                    'title': 'Начало карьеры',
                    'count': 356
                  },
                  {
                    'id': 137,
                    'title': 'Прочее',
                    'count': 341
                  },
                  {
                    'id': 617,
                    'title': 'Воспитание на дому',
                    'count': 329
                  },
                  {
                    'id': 517,
                    'title': 'Научная деятельность',
                    'count': 137
                  },
                  {
                    'id': 1277,
                    'title': 'Продажи образовательных услуг',
                    'count': 68
                  },
                  {
                    'id': 1317,
                    'title': 'Без спец. подготовки',
                    'count': 53
                  }
                ]
              },
              {
                'id': 78,
                'title': 'Маркетинг, реклама, PR',
                'count': 3316,
                'specialities': [
                  {
                    'id': 86,
                    'title': 'BTL/ATL, промоакции',
                    'count': 766
                  },
                  {
                    'id': 79,
                    'title': 'PR',
                    'count': 707
                  },
                  {
                    'id': 1037,
                    'title': 'Event, организация мероприятий',
                    'count': 666
                  },
                  {
                    'id': 1077,
                    'title': 'Маркетинговые исследования',
                    'count': 531
                  },
                  {
                    'id': 85,
                    'title': 'Маркетинговый анализ',
                    'count': 489
                  },
                  {
                    'id': 487,
                    'title': 'Наружная реклама',
                    'count': 476
                  },
                  {
                    'id': 489,
                    'title': 'Интернет-маркетинг',
                    'count': 456
                  },
                  {
                    'id': 1057,
                    'title': 'Печатная реклама',
                    'count': 445
                  },
                  {
                    'id': 80,
                    'title': 'Бренд-менеджмент',
                    'count': 440
                  },
                  {
                    'id': 89,
                    'title': 'Начало карьеры',
                    'count': 374
                  },
                  {
                    'id': 1137,
                    'title': 'Продажа рекламы и услуг',
                    'count': 350
                  },
                  {
                    'id': 90,
                    'title': 'Без спец. подготовки',
                    'count': 331
                  },
                  {
                    'id': 1097,
                    'title': 'Торговый маркетинг',
                    'count': 306
                  },
                  {
                    'id': 88,
                    'title': 'Копирайт',
                    'count': 302
                  },
                  {
                    'id': 1117,
                    'title': 'Управленческий персонал',
                    'count': 252
                  },
                  {
                    'id': 443,
                    'title': 'Прочее',
                    'count': 215
                  },
                  {
                    'id': 490,
                    'title': 'ТВ-реклама',
                    'count': 214
                  },
                  {
                    'id': 491,
                    'title': 'Реклама на радио',
                    'count': 186
                  },
                  {
                    'id': 488,
                    'title': 'Изготовление и монтаж рекламы',
                    'count': 184
                  }
                ]
              },
              {
                'id': 138,
                'title': 'Охрана, безопасность',
                'count': 3283,
                'specialities': [
                  {
                    'id': 139,
                    'title': 'ЧОП, охранники',
                    'count': 1781
                  },
                  {
                    'id': 1337,
                    'title': 'Системы видеонаблюдения',
                    'count': 749
                  },
                  {
                    'id': 144,
                    'title': 'Руководитель СБ',
                    'count': 526
                  },
                  {
                    'id': 140,
                    'title': 'Прочее',
                    'count': 459
                  },
                  {
                    'id': 148,
                    'title': 'Без спец. подготовки',
                    'count': 420
                  },
                  {
                    'id': 145,
                    'title': 'Экономическая безопасность',
                    'count': 419
                  },
                  {
                    'id': 143,
                    'title': 'Пожарная безопасность',
                    'count': 385
                  },
                  {
                    'id': 142,
                    'title': 'Личная безопасность',
                    'count': 300
                  },
                  {
                    'id': 147,
                    'title': 'Начало карьеры',
                    'count': 270
                  },
                  {
                    'id': 1377,
                    'title': 'Инженерные специальности',
                    'count': 204
                  },
                  {
                    'id': 141,
                    'title': 'Коллекторская деятельность',
                    'count': 130
                  },
                  {
                    'id': 1397,
                    'title': 'Рабочий персонал',
                    'count': 107
                  },
                  {
                    'id': 1357,
                    'title': 'Продажи',
                    'count': 42
                  }
                ]
              },
              {
                'id': 37,
                'title': 'Дизайн, искусство, развлечения',
                'count': 3109,
                'specialities': [
                  {
                    'id': 44,
                    'title': 'Художник, оформитель, иллюстратор',
                    'count': 714
                  },
                  {
                    'id': 41,
                    'title': 'Фотограф, видеооператор, звукорежиссер',
                    'count': 625
                  },
                  {
                    'id': 38,
                    'title': 'Дизайн интерьера',
                    'count': 591
                  },
                  {
                    'id': 46,
                    'title': 'Прочее',
                    'count': 462
                  },
                  {
                    'id': 3388,
                    'title': 'Развлечения, досуг',
                    'count': 414
                  },
                  {
                    'id': 49,
                    'title': 'Визуализация, 3d моделирование ',
                    'count': 413
                  },
                  {
                    'id': 47,
                    'title': 'Дизайнер промышленный',
                    'count': 320
                  },
                  {
                    'id': 45,
                    'title': 'Ведущий, аниматор, актер',
                    'count': 296
                  },
                  {
                    'id': 3288,
                    'title': 'Музыка',
                    'count': 242
                  },
                  {
                    'id': 42,
                    'title': 'Флористика',
                    'count': 190
                  },
                  {
                    'id': 39,
                    'title': 'Дизайн ландшафта',
                    'count': 182
                  },
                  {
                    'id': 3308,
                    'title': 'Кино',
                    'count': 166
                  },
                  {
                    'id': 43,
                    'title': 'Танцевальные направления',
                    'count': 156
                  },
                  {
                    'id': 3368,
                    'title': 'Мода',
                    'count': 149
                  },
                  {
                    'id': 3348,
                    'title': 'Театр',
                    'count': 140
                  },
                  {
                    'id': 3408,
                    'title': 'Обслуживающий персонал',
                    'count': 95
                  },
                  {
                    'id': 3328,
                    'title': 'Музеи',
                    'count': 52
                  }
                ]
              },
              {
                'id': 259,
                'title': 'Юриспруденция',
                'count': 3093,
                'specialities': [
                  {
                    'id': 263,
                    'title': 'Юрист',
                    'count': 2421
                  },
                  {
                    'id': 2757,
                    'title': 'Юридические консультации и услуги',
                    'count': 1364
                  },
                  {
                    'id': 2457,
                    'title': 'Договорное право',
                    'count': 1184
                  },
                  {
                    'id': 261,
                    'title': 'Арбитраж',
                    'count': 991
                  },
                  {
                    'id': 2697,
                    'title': 'Трудовое право',
                    'count': 936
                  },
                  {
                    'id': 266,
                    'title': 'Начало карьеры',
                    'count': 734
                  },
                  {
                    'id': 2617,
                    'title': 'Недвижимость',
                    'count': 705
                  },
                  {
                    'id': 2637,
                    'title': 'Семейное право',
                    'count': 632
                  },
                  {
                    'id': 2537,
                    'title': 'Корпоративное право',
                    'count': 590
                  },
                  {
                    'id': 2717,
                    'title': 'Уголовное право',
                    'count': 478
                  },
                  {
                    'id': 2497,
                    'title': 'Земельное право',
                    'count': 462
                  },
                  {
                    'id': 264,
                    'title': 'Начальник юридического отдела',
                    'count': 414
                  },
                  {
                    'id': 260,
                    'title': 'Адвокатура',
                    'count': 362
                  },
                  {
                    'id': 2677,
                    'title': 'Страховое право',
                    'count': 337
                  },
                  {
                    'id': 2597,
                    'title': 'Налоговое право',
                    'count': 299
                  },
                  {
                    'id': 262,
                    'title': 'Нотариат',
                    'count': 263
                  },
                  {
                    'id': 444,
                    'title': 'Прочее',
                    'count': 254
                  },
                  {
                    'id': 2437,
                    'title': 'Банковское право',
                    'count': 241
                  },
                  {
                    'id': 2517,
                    'title': 'Интеллектуальная собственность',
                    'count': 132
                  },
                  {
                    'id': 2477,
                    'title': 'Законотворчество',
                    'count': 125
                  },
                  {
                    'id': 2557,
                    'title': 'Международное право',
                    'count': 100
                  },
                  {
                    'id': 2397,
                    'title': 'Авторское право',
                    'count': 86
                  },
                  {
                    'id': 2657,
                    'title': 'Слияния и поглощения',
                    'count': 83
                  },
                  {
                    'id': 2417,
                    'title': 'Антимонопольное право',
                    'count': 77
                  },
                  {
                    'id': 267,
                    'title': 'Без спец. подготовки',
                    'count': 61
                  },
                  {
                    'id': 2737,
                    'title': 'Ценные бумаги',
                    'count': 53
                  },
                  {
                    'id': 2577,
                    'title': 'Морское право',
                    'count': 4
                  }
                ]
              },
              {
                'id': 252,
                'title': 'Кадровые службы, HR, охрана труда',
                'count': 2597,
                'specialities': [
                  {
                    'id': 254,
                    'title': 'Подбор персонала, рекрутинг',
                    'count': 1530
                  },
                  {
                    'id': 253,
                    'title': 'Кадровое делопроизводство',
                    'count': 1503
                  },
                  {
                    'id': 255,
                    'title': 'Развитие и обучение персонала',
                    'count': 1043
                  },
                  {
                    'id': 997,
                    'title': 'Управление персоналом',
                    'count': 971
                  },
                  {
                    'id': 258,
                    'title': 'Начало карьеры',
                    'count': 367
                  },
                  {
                    'id': 1017,
                    'title': 'Охрана труда',
                    'count': 246
                  },
                  {
                    'id': 957,
                    'title': 'Нормирование труда',
                    'count': 180
                  },
                  {
                    'id': 977,
                    'title': 'Оплата труда, компенсации и льготы',
                    'count': 161
                  },
                  {
                    'id': 256,
                    'title': 'Прочее',
                    'count': 149
                  },
                  {
                    'id': 257,
                    'title': 'Без спец. подготовки',
                    'count': 104
                  }
                ]
              },
              {
                'id': 91,
                'title': 'Медицина и фармация',
                'count': 2386,
                'specialities': [
                  {
                    'id': 96,
                    'title': 'Медперсонал',
                    'count': 901
                  },
                  {
                    'id': 92,
                    'title': 'Врачи',
                    'count': 365
                  },
                  {
                    'id': 97,
                    'title': 'Фармацевты',
                    'count': 330
                  },
                  {
                    'id': 1217,
                    'title': 'Регистратура',
                    'count': 301
                  },
                  {
                    'id': 95,
                    'title': 'Медицинское оборудование',
                    'count': 239
                  },
                  {
                    'id': 93,
                    'title': 'Прочее',
                    'count': 181
                  },
                  {
                    'id': 94,
                    'title': 'Медицинский представитель',
                    'count': 164
                  },
                  {
                    'id': 98,
                    'title': 'Начало карьеры',
                    'count': 161
                  },
                  {
                    'id': 1257,
                    'title': 'Лекарственные препараты',
                    'count': 134
                  },
                  {
                    'id': 1157,
                    'title': 'Ветеринария',
                    'count': 99
                  },
                  {
                    'id': 99,
                    'title': 'Сиделки, уход за больными',
                    'count': 90
                  },
                  {
                    'id': 1237,
                    'title': 'Провизоры',
                    'count': 87
                  },
                  {
                    'id': 1197,
                    'title': 'Оптика',
                    'count': 69
                  },
                  {
                    'id': 100,
                    'title': 'Без спец. подготовки',
                    'count': 57
                  },
                  {
                    'id': 1177,
                    'title': 'Дефектология',
                    'count': 51
                  },
                  {
                    'id': 637,
                    'title': 'Няни',
                    'count': 10
                  }
                ]
              },
              {
                'id': 533,
                'title': 'ТЭК, энергетика, добыча сырья',
                'count': 2311,
                'specialities': [
                  {
                    'id': 191,
                    'title': 'Энергетика',
                    'count': 1487
                  },
                  {
                    'id': 2217,
                    'title': 'Инженерные специальности',
                    'count': 1062
                  },
                  {
                    'id': 172,
                    'title': 'Добыча сырья',
                    'count': 516
                  },
                  {
                    'id': 2317,
                    'title': 'Газ',
                    'count': 490
                  },
                  {
                    'id': 2257,
                    'title': 'Управленческий персонал',
                    'count': 437
                  },
                  {
                    'id': 2357,
                    'title': 'Нефть',
                    'count': 407
                  },
                  {
                    'id': 534,
                    'title': 'Разведка и разработка',
                    'count': 318
                  },
                  {
                    'id': 2237,
                    'title': 'Рабочий персонал',
                    'count': 251
                  },
                  {
                    'id': 535,
                    'title': 'Начало карьеры',
                    'count': 186
                  },
                  {
                    'id': 2337,
                    'title': 'Металлы',
                    'count': 174
                  },
                  {
                    'id': 2377,
                    'title': 'Уголь',
                    'count': 153
                  },
                  {
                    'id': 537,
                    'title': 'Прочее',
                    'count': 148
                  },
                  {
                    'id': 2277,
                    'title': 'Продажи',
                    'count': 109
                  },
                  {
                    'id': 2297,
                    'title': 'Тендеры',
                    'count': 80
                  },
                  {
                    'id': 536,
                    'title': 'Без спец. подготовки',
                    'count': 39
                  }
                ]
              },
              {
                'id': 290,
                'title': 'Персонал для дома',
                'count': 1755,
                'specialities': [
                  {
                    'id': 291,
                    'title': 'Няня, гувернантка, воспитатель',
                    'count': 724
                  },
                  {
                    'id': 294,
                    'title': 'Домработница, помощь по дому, уборка',
                    'count': 455
                  },
                  {
                    'id': 451,
                    'title': 'Личный водитель',
                    'count': 428
                  },
                  {
                    'id': 292,
                    'title': 'Уход за больными и престарелыми',
                    'count': 105
                  },
                  {
                    'id': 446,
                    'title': 'Прочее',
                    'count': 57
                  },
                  {
                    'id': 453,
                    'title': 'Повар',
                    'count': 52
                  },
                  {
                    'id': 1417,
                    'title': 'Разнорабочий',
                    'count': 44
                  },
                  {
                    'id': 454,
                    'title': 'Садовник',
                    'count': 43
                  },
                  {
                    'id': 455,
                    'title': 'Репетитор',
                    'count': 16
                  }
                ]
              },
              {
                'id': 234,
                'title': 'Телекоммуникации и связь',
                'count': 1661,
                'specialities': [
                  {
                    'id': 236,
                    'title': 'Монтаж, обслуживание сетей',
                    'count': 707
                  },
                  {
                    'id': 237,
                    'title': 'Ремонт и обслуживание',
                    'count': 668
                  },
                  {
                    'id': 235,
                    'title': 'Инженерные специальности',
                    'count': 590
                  },
                  {
                    'id': 239,
                    'title': 'Начало карьеры',
                    'count': 110
                  },
                  {
                    'id': 238,
                    'title': 'Прочее',
                    'count': 106
                  },
                  {
                    'id': 240,
                    'title': 'Без спец. подготовки',
                    'count': 43
                  }
                ]
              },
              {
                'id': 518,
                'title': 'Государственные службы, НКО',
                'count': 1577,
                'specialities': [
                  {
                    'id': 522,
                    'title': 'Муниципалитет, администрация',
                    'count': 700
                  },
                  {
                    'id': 526,
                    'title': 'Федеральные службы',
                    'count': 663
                  },
                  {
                    'id': 520,
                    'title': 'ГИБДД, ДПС, полиция',
                    'count': 436
                  },
                  {
                    'id': 521,
                    'title': 'Государственные фонды',
                    'count': 410
                  },
                  {
                    'id': 524,
                    'title': 'Начало карьеры',
                    'count': 409
                  },
                  {
                    'id': 937,
                    'title': 'Общественные организации',
                    'count': 315
                  },
                  {
                    'id': 527,
                    'title': 'МЧС',
                    'count': 298
                  },
                  {
                    'id': 917,
                    'title': 'С опытом в госслужбе',
                    'count': 236
                  },
                  {
                    'id': 519,
                    'title': 'Военная служба',
                    'count': 212
                  },
                  {
                    'id': 523,
                    'title': 'Государственные архивы, библиотеки',
                    'count': 171
                  },
                  {
                    'id': 525,
                    'title': 'Без спец. подготовки',
                    'count': 166
                  },
                  {
                    'id': 528,
                    'title': 'Прочее',
                    'count': 127
                  }
                ]
              },
              {
                'id': 557,
                'title': 'Туризм, гостиничное дело',
                'count': 1561,
                'specialities': [
                  {
                    'id': 2157,
                    'title': 'Административный персонал',
                    'count': 720
                  },
                  {
                    'id': 215,
                    'title': 'Туристические услуги',
                    'count': 596
                  },
                  {
                    'id': 216,
                    'title': 'Гостиничный персонал',
                    'count': 448
                  },
                  {
                    'id': 558,
                    'title': 'Билеты, оформление документов',
                    'count': 295
                  },
                  {
                    'id': 561,
                    'title': 'Начало карьеры',
                    'count': 290
                  },
                  {
                    'id': 2177,
                    'title': 'Управленческий персонал',
                    'count': 153
                  },
                  {
                    'id': 559,
                    'title': 'Без спец. подготовки',
                    'count': 121
                  },
                  {
                    'id': 2197,
                    'title': 'Обслуживающий персонал',
                    'count': 90
                  },
                  {
                    'id': 560,
                    'title': 'Прочее',
                    'count': 68
                  }
                ]
              },
              {
                'id': 2777,
                'title': 'Инсталляция и сервис',
                'count': 1342,
                'specialities': [
                  {
                    'id': 2797,
                    'title': 'Инсталляция и настройка оборудования',
                    'count': 687
                  },
                  {
                    'id': 2917,
                    'title': 'Сервисный инженер',
                    'count': 473
                  },
                  {
                    'id': 2817,
                    'title': 'Промышленность, сельское хозяйство',
                    'count': 424
                  },
                  {
                    'id': 2837,
                    'title': 'Транспорт',
                    'count': 265
                  },
                  {
                    'id': 2857,
                    'title': 'ИТ, Интернет, телекоммуникации ',
                    'count': 264
                  },
                  {
                    'id': 2937,
                    'title': 'Управленческий персонал',
                    'count': 140
                  },
                  {
                    'id': 2897,
                    'title': 'ТЭК, энергетика, добыча сырья',
                    'count': 122
                  },
                  {
                    'id': 2877,
                    'title': 'Строительство',
                    'count': 99
                  },
                  {
                    'id': 7153,
                    'title': 'Прочее',
                    'count': 32
                  }
                ]
              },
              {
                'id': 482,
                'title': 'Полиграфия, издательства, СМИ',
                'count': 1256,
                'specialities': [
                  {
                    'id': 83,
                    'title': 'СМИ, пресса, интернет-издания',
                    'count': 517
                  },
                  {
                    'id': 82,
                    'title': 'Издательская деятельность, типография',
                    'count': 476
                  },
                  {
                    'id': 483,
                    'title': 'Верстка, дизайн',
                    'count': 408
                  },
                  {
                    'id': 84,
                    'title': 'Полиграфия',
                    'count': 403
                  },
                  {
                    'id': 81,
                    'title': 'Журналистика, корреспонденты',
                    'count': 359
                  },
                  {
                    'id': 485,
                    'title': 'Радио, телевидение',
                    'count': 220
                  },
                  {
                    'id': 484,
                    'title': 'Начало карьеры',
                    'count': 112
                  },
                  {
                    'id': 1537,
                    'title': 'Прочее',
                    'count': 82
                  },
                  {
                    'id': 1497,
                    'title': 'Продажи рекламы и услуг',
                    'count': 73
                  },
                  {
                    'id': 1517,
                    'title': 'Управленческий персонал',
                    'count': 55
                  },
                  {
                    'id': 486,
                    'title': 'Без спец. подготовки',
                    'count': 42
                  }
                ]
              },
              {
                'id': 562,
                'title': 'Сфера услуг',
                'count': 932,
                'specialities': [
                  {
                    'id': 228,
                    'title': 'Уборка помещений, мойка окон',
                    'count': 438
                  },
                  {
                    'id': 567,
                    'title': 'Прочее',
                    'count': 165
                  },
                  {
                    'id': 566,
                    'title': 'Одежда, обувь',
                    'count': 141
                  },
                  {
                    'id': 564,
                    'title': 'Ремонт сотовых телефонов, компьютеров',
                    'count': 140
                  },
                  {
                    'id': 565,
                    'title': 'Бытовые услуги',
                    'count': 114
                  },
                  {
                    'id': 657,
                    'title': 'Домработница, уборка квартир',
                    'count': 92
                  },
                  {
                    'id': 563,
                    'title': 'Ремонт бытовой техники',
                    'count': 67
                  }
                ]
              },
              {
                'id': 282,
                'title': 'Страхование',
                'count': 372,
                'specialities': [
                  {
                    'id': 283,
                    'title': 'Автострахование',
                    'count': 186
                  },
                  {
                    'id': 287,
                    'title': 'Страхование физических лиц',
                    'count': 98
                  },
                  {
                    'id': 2017,
                    'title': 'Страхование имущества',
                    'count': 82
                  },
                  {
                    'id': 286,
                    'title': 'Страхование недвижимости',
                    'count': 74
                  },
                  {
                    'id': 1957,
                    'title': 'Страхование жизни',
                    'count': 70
                  },
                  {
                    'id': 2057,
                    'title': 'Оценка и экспертиза',
                    'count': 64
                  },
                  {
                    'id': 2037,
                    'title': 'Урегулирование убытков',
                    'count': 60
                  },
                  {
                    'id': 2097,
                    'title': 'Продажи',
                    'count': 59
                  },
                  {
                    'id': 288,
                    'title': 'Страхование юридических лиц',
                    'count': 49
                  },
                  {
                    'id': 1937,
                    'title': 'Медицинское страхование',
                    'count': 48
                  },
                  {
                    'id': 2117,
                    'title': 'Начало карьеры',
                    'count': 41
                  },
                  {
                    'id': 284,
                    'title': 'Прочее',
                    'count': 35
                  },
                  {
                    'id': 1977,
                    'title': 'Пенсионное страхование',
                    'count': 34
                  },
                  {
                    'id': 289,
                    'title': 'Страхование коммерческих и финансовых рисков',
                    'count': 31
                  },
                  {
                    'id': 2077,
                    'title': 'Управленческий персонал',
                    'count': 28
                  },
                  {
                    'id': 285,
                    'title': 'Страхование грузов',
                    'count': 24
                  },
                  {
                    'id': 2137,
                    'title': 'Без спец. подготовки',
                    'count': 17
                  },
                  {
                    'id': 1997,
                    'title': 'Актуарная деятельность',
                    'count': 6
                  }
                ]
              },
              {
                'id': 597,
                'title': 'Сельское хозяйство',
                'count': 213,
                'specialities': [
                  {
                    'id': 600,
                    'title': 'Растениеводство',
                    'count': 56
                  },
                  {
                    'id': 598,
                    'title': 'Животноводство',
                    'count': 55
                  },
                  {
                    'id': 602,
                    'title': 'Сельскохозяйственная техника',
                    'count': 47
                  },
                  {
                    'id': 601,
                    'title': 'Агрономия',
                    'count': 46
                  },
                  {
                    'id': 599,
                    'title': 'Птицеводство',
                    'count': 32
                  },
                  {
                    'id': 603,
                    'title': 'Начало карьеры',
                    'count': 21
                  },
                  {
                    'id': 7052,
                    'title': 'Прочее',
                    'count': 9
                  },
                  {
                    'id': 604,
                    'title': 'Без спец. подготовки',
                    'count': 7
                  }
                ]
              },
              {
                'id': 464,
                'title': 'Прочее',
                'count': 50,
                'specialities': [
                  {
                    'id': 465,
                    'title': 'Другие сферы деятельности',
                    'count': 9
                  }
                ]
              }
            ],
            'average_salary': 29193,
            'deprecations': [
              {
                'code': 'deprecated_query_param',
                'field': 'city_id',
                'message': 'Параметр \'city_id\' является устаревшим. Используйте вместо него \'geo_id\''
              }
            ],
            'resultset': {
              'count': 136233,
              'limit': 25,
              'offset': 0
            }
          },
          'resumes': [
            {
              'id': 26783068,
              'owner_id': 43774168,
              'wanted_salary': 35000,
              'wanted_salary_rub': 35000,
              'age': 39,
              'header': 'Бухгалтер по расчету заработной платы',
              'personal_qualities': '',
              'institution': 'Екатеринбургский Энергетический техникум',
              'education_specialty': 'Бухгалтер - Экономист',
              'education_description': '',
              'experience': 'Мардисламова Эльвира Райфатовна\r\nЦЕЛЬ:\r\n          Ищу работу в качестве:\r\nБухгалтера по расчету заработной плате, возможно в единственном лице , менеджера и др. специальности\r\n(рассмотрю любые предложения)\r\n\r\nОБЩАЯ ИНФОРМАЦИЯ О СЕБЕ:\r\nмарт 1977 г.р., не замужем. Дети/один-14 лет\r\nПроживаю по адресу:  Свердл. Обл. г. Екатеринбург, ул. Благодатская \r\n \r\nОБРАЗОВАНИЕ:\r\nЕкатеринбургский энергетический техникум. \r\nПериод обучения: 1997-2000 гг.\r\nСпециальность /Бухгалтер-экономист /, очная форма обучения \r\n\r\nТРУДОВАЯ ДЕЯТЕЛЬНОСТЬ:\r\n   с февраля 2011 г. по февраль 2013 г.  в ООО\'Доброгост\'\r\nДолжностные обязанности: расчет заработной платы, начисление отпускных, расчет листов нетрудоспособности, расчет увольнения сотрудников, удержания из заработной платы(исполнительные листы),Сдача отчетности: ПФ, ФСС, Перс.отч. ,НДФЛ.1С.8.2, авансовые отчеты\r\n\r\n   с апреля 2013 г. НЧДОУ \'Согласие\'\r\nДолжностные обязанности: в ед.лице расчет заработной платы, начисление отпускных, расчет листов нетрудоспособности, расчет увольнения сотрудников,начисление род.платы , клиент банк ,Сдача отчетности: ПФ, ФСС, Перс.отч. ,НДФЛ.1С.8.2\r\n\r\nс 10.2014 г. по 04.2016 АО НПФ Образование\r\nДолжностные обязанности: расчет заработной платы, начисление отпускных, расчет листов нетрудоспособности, расчет увольнения сотрудников, удержания из заработной платы(исполнительные листы),Сдача отчетности: ПФ, ФСС, Перс.отч. ,НДФЛ. стат.отчетность , основные средства,авансовые отчеты,контроль Дт.,Кт.задолженности, касса , банк  , управленческий учет  ,участие в инвентаризациях ,подготовка бухгалтерских документов для архивирования ,выставление счетов ,основные средства, касса , Клиент банк(сбербанк , альфабанк , убрир) ,Сдача отчетности: ПФ, ФСС, Перс.отч. , реестры ДСВ ,НДФЛ., 1:С7 , 1:С.8.2 , Взаимодействие с банками, в части зарплатного проекта (заявки на открытие л/с, получение и выдача з/п карт) , Выгрузка данных из 1С ЗуП в 1С Бухгалтерия с последующей проверкой\r\n\r\n   с 06.06.2016 по настоящее время\r\nООО ПК ПОЛИ-ГРУПП\r\nДолжностные обязанности: расчет заработной платы, начисление отпускных, расчет листов нетрудоспособности, расчет увольнения сотрудников, удержания из заработной платы(исполнительные листы),Сдача отчетности: ПФ, ФСС, Перс.отч. ,НДФЛ. , Банк , , Взаимодействие с банками, в части зарплатного проекта (заявки на открытие л/с, получение и выдача з/п карт) , Выгрузка данных из 1С ЗуП в 1С Бухгалтерия с последующей проверкой\r\n\r\n  \r\nДОПОЛНИТЕЛЬНЫЕ ТРУДОВЫЕ НАВЫКИ:\r\nМогу  применять знания и опыт в соответствии с опытом и исполняемыми в настоящее время должностными обязанностями.Изучать и осваивать другие программы.\r\nВладение ПК: Пользователь  Word, Excel, 1С: Бухгалтерия, 7.7,  1С.8.2 , 8(УПП) 8(ЗУП), Амба,Консультант+ , работа с банками (Альфа банк , сбербанк , Убрир банк) СКБ Контур\r\n\r\nДОПОЛНИТЕЛЬНАЯ ИНФОРМАЦИЯ:\r\nВозможна работа бухгалтером в единственном лице.\r\nСвоими основными  качествами считаю инициативность, коммуникабельность, стрессоустойчивость, ответственность, обучаемость  и настойчивость.\r\nСохранность корпоративных секретов гарантирую.',
              'url': '/resume/Buhgalter_po_raschetu_zarabotnoy_plati?id=26783068',
              'skills': '',
              'birthday': '1977-03-10',
              'add_date': '2013-03-14T15:19:58+07:00',
              'mod_date': '2016-09-14T13:29:10+07:00',
              'removal': false,
              'is_driver': false,
              'is_journey': false,
              'is_smoke': false,
              'has_child': true,
              'sex': 'female',
              'marital_status': 'single',
              'surname_hide': false,
              'can_accept_replies': true,
              'hide_birthday': false,
              'visibility_type': 'viewAll',
              'education': {
                'id': 390,
                'title': 'средне-специальное'
              },
              'working_type': {
                'id': 309,
                'title': 'полная занятость'
              },
              'schedule': {
                'id': 305,
                'title': 'полный рабочий день'
              },
              'currency': {
                'id': 299,
                'title': 'руб.',
                'alias': 'RUR'
              },
              'experience_length': {
                'id': 3004,
                'title': 'более 5 лет'
              },
              'citizenship': null,
              'cities_references': [
                {
                  'id': 994,
                  'title': 'Екатеринбург',
                  'districts': [
                    {
                      'id': 258351,
                      'title': 'Автовокзал'
                    },
                    {
                      'id': 258381,
                      'title': 'Елизавет'
                    },
                    {
                      'id': 258401,
                      'title': 'Уктус'
                    },
                    {
                      'id': 258411,
                      'title': 'Химмаш'
                    },
                    {
                      'id': 258371,
                      'title': 'Чермет'
                    },
                    {
                      'id': 258391,
                      'title': 'Шинный'
                    }
                  ],
                  'subways': []
                }
              ],
              'driver_licenses': [],
              'languages': [],
              'secondary_educations': [],
              'institutions': [],
              'jobs': [],
              'rubrics': [
                {
                  'id': 1,
                  'title': 'Бухгалтерия, финансы, банки',
                  'specialities': [
                    {
                      'id': 6,
                      'title': 'Бухгалтерия'
                    },
                    {
                      'id': 837,
                      'title': 'Учёт заработной платы'
                    }
                  ]
                }
              ],
              'recommendations': [],
              'state': 1,
              'validate_state': 1,
              'entity': 1,
              'contact': {
                'name': ' Эльвира Райфатовна',
                'firstname': 'Эльвира',
                'patronymic': 'Райфатовна',
                'street': '',
                'building': '',
                'room': '',
                'subway': {
                  'id': 177,
                  'title': 'Ботаническая'
                },
                'district': {
                  'id': 258391,
                  'title': 'Шинный'
                },
                'address_description': null,
                'address': null,
                'city': {
                  'id': 994,
                  'title': 'Екатеринбург',
                  'locative': 'Екатеринбурге'
                },
                'icq': null,
                'skype': '',
                'url': '',
                'facebook': null,
                'moi_krug': null,
                'linkedin': null,
                'twitter': null,
                'vk': null,
                'use_messages': true
              },
              'photo': {
                'id': '574e570b69fd6f0e328b456a',
                'url': 'https://cdn3.zp.ru/job/attaches/2016/06/26/9d/269dc8b11bbeb79b942361b11449a33e.jpg',
                'size': '560,50 kB'
              },
              'salary': '35 000 руб.',
              'info_short': 'средне-специальное образование',
              'info': 'средне-специальное образование, полный рабочий день',
              'views': 17,
              'access_status': null,
              'access_due_date': null,
              'apiece_count': null,
              'is_upped': true,
              'is_limit_exceeded': false,
              'is_deleted': false,
              'is_archived': false,
              'legacy': true,
              'priority': 200,
              'attachment': null,
              'work_time_total': {
                'year': 0,
                'month': 0
              },
              'subways': [],
              'districts': [
                {
                  'id': 258351,
                  'title': 'Автовокзал'
                },
                {
                  'id': 258381,
                  'title': 'Елизавет'
                },
                {
                  'id': 258401,
                  'title': 'Уктус'
                },
                {
                  'id': 258411,
                  'title': 'Химмаш'
                },
                {
                  'id': 258371,
                  'title': 'Чермет'
                },
                {
                  'id': 258391,
                  'title': 'Шинный'
                }
              ],
              'tags': [],
              'imported_via': '',
              'url_doc': 'http://export-doc.zp.ru/?resume_id=26783068&user_id=1&sign=c11dbccc0c2f17c7ee7c1f2129bf49c2243af17b×tamp=1473920951',
              'url_pdf': 'http://export-pdf.zp.ru/?resume_id=26783068&user_id=1&sign=c11dbccc0c2f17c7ee7c1f2129bf49c2243af17b×tamp=1473920951',
              'contact_geo_ids': [
                1219,
                58753,
                55968,
                66,
                994
              ],
              'last_log': {
                'reason_id': 0,
                'reason': null,
                'user_id': 3786355,
                'created_at': {
                  'date': '2016-08-31 22:19:05.000000',
                  'timezone_type': 3,
                  'timezone': 'Asia/Novosibirsk'
                }
              },
              'favorite': false,
              'hided': false
            }
        ]
        }";

            E1CV cv = JsonConvert.DeserializeObject<E1CV>(json);

            return cv;
        }
    }
}
